import "locale";

var d3_locale_ukUA = d3.locale({
  decimal: ",",
  thousands: "\xa0",
  grouping: [3],
  currency: ["", " ₴."],
  dateTime: "%A, %e %B %Y р. %X",
  date: "%d.%m.%Y",
  time: "%H:%M:%S",
  periods: ["дп", "пп"], // unused
  days: ["неділя", "понеділок", "вівторок", "середа", "четвер", "п'ятниця", "субота"],
  shortDays: ["нд", "пн", "вт", "ср", "чт", "пт", "сб"],
  months: ["січня", "лютого", "березня", "квітня", "травня", "червня", "липня", "серпня", "вересня", "жовтня", "листопада", "грудня"],
  shortMonths: ["січ.", "лют.", "бер.", "квіт.", "трав.", "черв.", "лип.", "серп.", "вер.", "жовт.", "лист.", "груд."]
});